package ClassicTopics1;
/**
 * 题目：一个数如果恰好等于它的因子之和，这个数就称为"完数"。例如6=1＋2＋3.编程找出1000以内的所有完数。
 *       *  利用for循环判断所有因数的和是否和输入的值是否相等，相等的话输出
 *       *  求因数的方法：
 *       *  （1）两个嵌套循环，并用i%j==0,关于i和j的值范围：i从1到1000逐个遍历，j只需不大于i/2+1即可
 *       *  比如：48，最大的因数才24,99最大的因数是33，因数不会大于本身数的一半
 *       *  （2）j就是我们所求的因数，把所有的j相加，就可以得到因数总和
 *       *  （3）因数总和已经包含1了，因为第一次就保存1了
 */
public class Completes {
    public static void main(String[] args) {
        System.out.println("1000以内的数为");
        //遍历这1000个数
        for(int i=1;i<=1000;i++){
            int sum=0;
            for(int j=1;j<=i/2+1;j++){//（因数不会大于本身数的一半）
                //找出能被其整除的数
                if(i%j==0){
                    //将其因数加进去
                    sum=sum+j;
                    //当计算出所有因数加进去后等于原数，则该数是完数
                if(i==sum) {
                    System.out.println(i + "");
                }
                }
            }
        }
    }
}
